src/AccumulationRegisters/НаличныеРасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>НаличныеРасчеты</Name>
			<Comment>Блок учета наличных расчетов</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма наличной оплаты в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОплат</Name>
			<Comment>Типы оплаты в рознице</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Оплата наличными</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
					<Comment>Оплата платежными картами</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Оплата в кредит</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлубнаяКарта</Name>
					<Comment>Оплата клубной картой</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
					<Comment>Оплата талоном/купоном</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетЗаведения</Name>
					<Comment>Оплата за счет заведения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/AccumulationRegisters/НаличныеРасчеты/Ext/ManagerModule.bsl
// Модуль менеджера регистра накоплений "Наличные расчеты"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения нового регистра по уже проведенным документам.
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	-РасходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента,
	               |	РасходныйКассовыйОрдер.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	РасходныйКассовыйОрдер.ХозОперация КАК ХозОперация,
	               |	РасходныйКассовыйОрдер.Ссылка КАК Ссылка,
	               |	РасходныйКассовыйОрдер.Дата КАК Дата,
	               |	РасходныйКассовыйОрдер.ВалютаДокумента КАК ВалютаДокумента,
	               |	РасходныйКассовыйОрдер.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	               |ИЗ
	               |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	               |ГДЕ
	               |	РасходныйКассовыйОрдер.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РасходныйКассовыйОрдер)
	               |	И РасходныйКассовыйОрдер.Проведен = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдер.СуммаДокумента,
	               |	ПриходныйКассовыйОрдер.ДоговорВзаиморасчетов,
	               |	ПриходныйКассовыйОрдер.ХозОперация,
	               |	ПриходныйКассовыйОрдер.Ссылка,
	               |	ПриходныйКассовыйОрдер.Дата,
	               |	ПриходныйКассовыйОрдер.ВалютаДокумента,
	               |	ПриходныйКассовыйОрдер.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ПриходныйКассовыйОрдер.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПриходныйКассовыйОрдер)
	               |	И ПриходныйКассовыйОрдер.Проведен = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЧекОплаты.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаВозврат)
	               |			ТОГДА -(ЧекОплаты.Сумма - ЧекОплаты.Сдача)
	               |		ИНАЧЕ ЧекОплаты.Сумма - ЧекОплаты.Сдача
	               |	КОНЕЦ,
	               |	ЧекОплаты.ДоговорВзаиморасчетов,
	               |	ЧекОплаты.Ссылка.ХозОперация,
	               |	ЧекОплаты.Ссылка,
	               |	ЧекОплаты.Ссылка.Дата,
	               |	ЧекОплаты.Ссылка.ВалютаДокумента,
	               |	ЧекОплаты.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
	               |ИЗ
	               |	Документ.Чек.Оплаты КАК ЧекОплаты
	               |ГДЕ
	               |	НЕ ЧекОплаты.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	               |	И ЧекОплаты.ТипОплаты.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплат.Наличные)
	               |	И ЧекОплаты.Ссылка.Проведен = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЧекНаОплатуОплаты.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаОплатуПокупки)
	               |				ИЛИ ЧекНаОплатуОплаты.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаОплатуВозврат)
	               |			ТОГДА -(ЧекНаОплатуОплаты.Сумма - ЧекНаОплатуОплаты.Сдача)
	               |		ИНАЧЕ ЧекНаОплатуОплаты.Сумма - ЧекНаОплатуОплаты.Сдача
	               |	КОНЕЦ,
	               |	ЧекНаОплатуОплаты.Ссылка.ДоговорВзаиморасчетов,
	               |	ЧекНаОплатуОплаты.Ссылка.ХозОперация,
	               |	ЧекНаОплатуОплаты.Ссылка,
	               |	ЧекНаОплатуОплаты.Ссылка.Дата,
	               |	ЧекНаОплатуОплаты.Ссылка.ВалютаДокумента,
	               |	ЧекНаОплатуОплаты.Ссылка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
	               |ИЗ
	               |	Документ.ЧекНаОплату.Оплаты КАК ЧекНаОплатуОплаты
	               |ГДЕ
	               |	ЧекНаОплатуОплаты.ТипОплаты.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплат.Наличные)
	               |	И ЧекНаОплатуОплаты.Ссылка.Проведен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	Пока РезультатЗапроса.Следующий() Цикл
		
		// Сумма наличными должны быть в валюте договора
		ВалютаДоговора	= РезультатЗапроса.ВалютаВзаиморасчетов;
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДоговора, РезультатЗапроса.Дата);
		КурсДоговора        = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		
		ВалютаДокумента	= РезультатЗапроса.ВалютаДокумента;
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, РезультатЗапроса.Дата);
		КурсДокумента = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		
		СуммаНаличными = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(РезультатЗапроса.СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаДоговора,КурсДоговора);
		
		// Приходуем наличные средства
		НаборЗаписей = РегистрыНакопления.НаличныеРасчеты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(РезультатЗапроса.Ссылка);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период				= РезультатЗапроса.Дата;
		НоваяЗапись.Регистратор			= РезультатЗапроса.Ссылка;
		НоваяЗапись.ДоговорВзаиморасчетов = РезультатЗапроса.ДоговорВзаиморасчетов;
		НоваяЗапись.Сумма 		= Окр(СуммаНаличными,2);
		
		// Определяемся с хоз. операцией
		НоваяЗапись.ХозОперация = РезультатЗапроса.ХозОперация;
		НаборЗаписей.Записать();   
		
	КонецЦикла;	
			
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
